In [1]:
# conda install pymysql
# anaconda prompt

In [2]:
import pymysql as m

In [3]:
con = m.connect(host='localhost', user='root', password='1234', charset='utf8')
cur = con.cursor()

In [4]:
q = "CREATE DATABASE DB_FROM_PYTHON;"
cur.execute(q)
con.close()
#close 하지 않으면 sql에 리소스 부담

ProgrammingError: (1007, "Can't create database 'db_from_python'; database exists")

In [ ]:
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = """CREATE TABLE table_from_python(
id INTEGER PRIMARY KEY,
name VARCHAR(100),
eamil VARCHAR(100),
division VARCHAR(100)
)
"""
cur.execute(q)
con.commit()
con.close()

In [ ]:
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = """INSERT INTO table_from_python2(id, name, division)
VALUES (1, 'kim', 'dev')
"""
cur.execute(q)
con.commit()
con.close()

In [ ]:
# jump to python 62p
mes1 = "hello, {0}".format("Mr.Kim")
print (mes1)

In [ ]:
#실패
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "INSERT INTO talbe_from_python2(id, name, division) VALUES ({0}, {1}, {2})"
cur.execute(q.format(1, "Kim", "SEE")
cur.execute(q.format(2, "Lee", "SEA")
cur.execute(q.format(3, "Park", "SSI")
cur.execute(q)
con.commit()

In [ ]:
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "INSERT INTO table_from_python2(id, name, division) VALUE (%s, %s, %s)"
cur.execute(q, (1, "Kim", "SEE"))
cur.execute(q, (2, "Lee", "SEA"))
cur.execute(q, (3, "Park", "SSI"))
con.commit()
con.close()

In [ ]:
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = 'SELECT * FROM table_from_python;'
cur.execute(q)
res = cur.fetchall()
# 코드는 접수 되었으나 파이썬내에 출력이 불가
for data in res:
    print(data)
# 코드를 줄마다 읽어서 출력
con.commit()
con.close()

In [ ]:
con = m.connect(host='localhost', user='root', password='7751', db ='DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "INSERT INTO table_from_python2(id, name, division) VALUE(%s, %s, %s)" # 전체가 str 이기때문에 id Value 또한 str로 맞춘다.
cur.execute(q, (1, 'Kim', 'DEV'))
cur.execute(q, (2, 'Lee', 'SAL'))
cur.execute(q, (3, 'Park', 'ADM'))
con.commit()
con.close()

In [ ]:
import pandas as pd
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = 'SELECT * FROM table_from_python;'
cur.execute(q)
res = cur.fetchall()
# 코드는 접수 되었으나 파이썬내에 출력이 불가
df1 = pd.DataFrame(res)
con.commit()
con.close()

In [ ]:
import pandas as pd
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = 'SELECT * FROM table_from_python;'
cur.execute(q)
res = cur.fetchall()
col = ["id", "name", "email", "division"]
# 코드는 접수 되었으나 파이썬내에 출력이 불가
df1 = pd.DataFrame(res, coulumns = col)
con.close()
df1.to_csv("my_csv2.csv")

In [ ]:
con = m.connect(host='localhost', user='root', password='1234',
                db = 'DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "UPDATE TABLE_FROM_PYTHON SET email =%s WHERE id =%s;"
cur.execute(q, ("asd1.@a.com", 1))
cur.execute(q, ("asd2.@a.com", 2))
cur.execute(q, ("asd3.@a.com", 3))
con.commit()
con.close()

In [ ]:
con = m.connect(host='localhost', user='root', password='1234', db ='DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = """CREATE TABLE table_from_python3(
id INTEGER PRIMARY KEY,
name VARCHAR(100),
email VARCHAR(100),
division VARCHAR(100)
) 
"""

cur.execute(q)
con.commit()
con.close()

In [ ]:
con = m.connect(host='localhost', user='root', password='1234', db ='DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "INSERT INTO table_from_python3(id, name, division) VALUE(%s, %s, %s)" # 전체가 str 이기때문에 id Value 또한 str로 맞춘다.
cur.execute(q, (1, 'Kim', 'DEV'))
cur.execute(q, (2, 'Lee', 'SAL'))
cur.execute(q, (3, 'Park', 'ADM'))
con.commit()
con.close()

In [ ]:
con = m.connect(host='localhost', user='root', password='1234', db ='DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "INSERT INTO table_from_python3(id, name, division) VALUE(%s, %s, %s)" # 전체가 str 이기때문에 id Value 또한 str로 맞춘다.
cur.execute(q, (1, 'Kim', 'DEV'))
cur.execute(q, (2, 'Lee', 'SAL'))
cur.execute(q, (3, 'Park', 'ADM'))
con.commit()
con.close()

In [ ]:
con = m.connect(host='localhost', user='root', password='1234', db ='DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "SELECT * FROM table_from_python3"
cur.execute(q)                        # 명령은 했으나 불러올 곳이 없음.
res = cur.fetchall()                  # .fetchall을 사용해 명령 데이터를 받아옴
for data in res:                      # 반복문을 통해 출력
    print(data)
con.close()

In [ ]:
import pandas as pd
con = m.connect(host='localhost', user='root', password='1234', db ='DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "SELECT * FROM table_from_python3"
cur.execute(q)                        # 명령은 했으나 불러올 곳이 없음.
res = cur.fetchall()                  # .fetchall을 사용해 명령 데이터를 받아옴
df1 = pd.DataFrame(res)
con.close()
df1

In [ ]:
col = ['id', 'name', 'email', 'division']
df1 = pd.DataFrame(res, columns =col)
df1

In [5]:
con = m.connect(host='localhost', user='root', password='1234', db ='DB_FROM_PYTHON', charset='utf8')
cur = con.cursor()
q = "UPDATE table_from_python3 SET email =%s WHERE id =%s;"
cur.execute(q, ("developer_kim@good.com", 1))
cur.execute(q, ("sales_pro_lee@good.com", 2))
cur.execute(q, ("admin_park@good.com", 3))
con.commit()                
con.close()

In [13]:
import pandas as pd
df_titanic = pd.read_csv("C:/Programmierung/workspace/Python_2021/examples/titanic_full.csv")

In [14]:
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Hometown,Boarded,Destination,Lifeboat,Body
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"Jyv채skyl채, Finland",Southampton,New York City,14?,NaN
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,"London, England",Southampton,New York City,NaN,NaN
1305,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,"Madrid, Spain",Cherbourg,"New York, New York, US",8,NaN
1306,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,"Skaun, S첩r-Tr첩ndelag, Norway",Southampton,US,NaN,32MB
1307,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,"Greenwich, London, England",Southampton,New York City,NaN,NaN
1308,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,"Sar'al[81], Syria",Cherbourg,"Detroit, Michigan, US",D,NaN

In [17]:
df_c = df_tita_2.corr()
df_c

NameError: name 'df_tita_2' is not defined

In [15]:
import matplotlib.pyplot as plt
import seaborn as sn

In [ ]:
sn.heatmap(df_c, annot=TRUE)
plt.show()

In [ ]:
sn.heatmap(df_c)
plt.show()